In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import datetime
import plotly.express as px
plt.style.use('ggplot')

import warnings
warnings.filterwarnings('ignore')

In [2]:
df=pd.read_csv('Projects/Salaries_for_San_Francisco_Employee/Total.csv', 
               low_memory=False)
df.head()

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,Not Provided,567595.43,567595.43,2011
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,Not Provided,538909.28,538909.28,2011
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,Not Provided,335279.91,335279.91,2011
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,Not Provided,332343.61,332343.61,2011
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,Not Provided,326373.19,326373.19,2011

In [3]:
df.dtypes

EmployeeName         object
JobTitle             object
BasePay              object
OvertimePay          object
OtherPay             object
Benefits             object
TotalPay            float64
TotalPayBenefits    float64
Year                  int64
dtype: object

In [4]:
df.shape

(312882, 9)

In [5]:
df['BasePay'] = pd.to_numeric(df['BasePay'], errors = 'coerce')
df['OvertimePay'] = pd.to_numeric(df['OvertimePay'], errors = 'coerce')
df['OtherPay'] = pd.to_numeric(df['OtherPay'], errors = 'coerce')

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 312882 entries, 0 to 312881
Data columns (total 9 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      312882 non-null  object
 1   JobTitle          312882 non-null  object
 2   BasePay           312276 non-null  float64
 3   OvertimePay       312881 non-null  float64
 4   OtherPay          312881 non-null  float64
 5   Benefits          312882 non-null  object
 6   TotalPay          312882 non-null  float64
 7   TotalPayBenefits  312882 non-null  float64
 8   Year              312882 non-null  int64
dtypes: float64(5), int64(1), object(3)
memory usage: 21.5+ MB

In [7]:
df.isnull().sum()

EmployeeName          0
JobTitle              0
BasePay             606
OvertimePay           1
OtherPay              1
Benefits              0
TotalPay              0
TotalPayBenefits      0
Year                  0
dtype: int64

In [8]:
df.isnull().sum().sum()

608

In [9]:
df.isnull().values.any()

True

In [10]:
df.shape

(312882, 9)

In [11]:
df['BasePay'].fillna(df['BasePay'].mean(), inplace=True)

In [12]:
df.isnull().sum()

EmployeeName        0
JobTitle            0
BasePay             0
OvertimePay         1
OtherPay            1
Benefits            0
TotalPay            0
TotalPayBenefits    0
Year                0
dtype: int64

In [13]:
df = df.dropna(subset=['OvertimePay', 'OtherPay'])

In [14]:
df.isnull().sum()

EmployeeName        0
JobTitle            0
BasePay             0
OvertimePay         0
OtherPay            0
Benefits            0
TotalPay            0
TotalPayBenefits    0
Year                0
dtype: int64

In [15]:
df.shape

(312881, 9)

## Other tricky method

In [27]:
#Extracting numeric column names from the dataset
numeric_column=df.select_dtypes(include=np.number).columns.tolist()
numeric_column

['BasePay', 'OvertimePay', 'OtherPay', 'TotalPay', 'TotalPayBenefits', 'Year']

In [10]:
# get the number of missing data points per column
missing_values_count = df.isnull().sum()

# look at the # of missing points in the first ten columns
missing_values_count

EmployeeName          0
JobTitle              0
BasePay             606
OvertimePay           1
OtherPay              1
Benefits              0
TotalPay              0
TotalPayBenefits      0
Year                  0
dtype: int64

In [11]:
# how many total missing values do we have?
total_cells = np.product(df.shape)
total_missing = missing_values_count.sum()

# percent of data that is missing
(total_missing/total_cells) * 100

0.02159138446940238

In [12]:
# remove all the rows that contain a missing value
df.dropna()

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,Not Provided,567595.43,567595.43,2011
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,Not Provided,538909.28,538909.28,2011
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,Not Provided,335279.91,335279.91,2011
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,Not Provided,332343.61,332343.61,2011
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,Not Provided,326373.19,326373.19,2011
...,...,...,...,...,...,...,...,...,...
312877,Daniel W Plautz,Public Service Trainee,0.00,0.00,0.00,0.00,0.00,0.00,2018
312878,David J Thompson,Deputy Sheriff,0.00,0.00,0.00,0.00,0.00,0.00,2018
312879,Keiko Weng Yee Lau,Public Service Trainee,0.00,0.00,0.00,0.00,0.00,0.00,2018
312880,David Wong,Deputy Sheriff,0.00,0.00,0.00,0.00,0.00,0.00,2018
312881,Debora E Howard,Recreation Leader,0.00,0.00,0.00,0.00,0.00,0.00,2018

In [13]:
# remove all columns with at least one missing value
columns_with_na_dropped = df.dropna(axis=1)
columns_with_na_dropped.head()

,EmployeeName,JobTitle,Benefits,TotalPay,TotalPayBenefits,Year
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,Not Provided,567595.43,567595.43,2011
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),Not Provided,538909.28,538909.28,2011
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),Not Provided,335279.91,335279.91,2011
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,Not Provided,332343.61,332343.61,2011
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",Not Provided,326373.19,326373.19,2011

In [14]:
# just how much data did we lose?
print("Columns in original dataset: %d " % df.shape[1])
print("Columns with na's dropped: %d" % columns_with_na_dropped.shape[1])

Columns in original dataset: 9
Columns with na's dropped: 6

In [15]:
# get a small subset of the dataset
subset_df = df.loc[:, numeric_column].head()
subset_df

     BasePay  OvertimePay   OtherPay   TotalPay  TotalPayBenefits  Year
0  167411.18         0.00  400184.25  567595.43         567595.43  2011
1  155966.02    245131.88  137811.38  538909.28         538909.28  2011
2  212739.13    106088.18   16452.60  335279.91         335279.91  2011
3   77916.00     56120.71  198306.90  332343.61         332343.61  2011
4  134401.60      9737.00  182234.59  326373.19         326373.19  2011

In [16]:
# replace all NA's with 0
subset_df.fillna(0)

     BasePay  OvertimePay   OtherPay   TotalPay  TotalPayBenefits  Year
0  167411.18         0.00  400184.25  567595.43         567595.43  2011
1  155966.02    245131.88  137811.38  538909.28         538909.28  2011
2  212739.13    106088.18   16452.60  335279.91         335279.91  2011
3   77916.00     56120.71  198306.90  332343.61         332343.61  2011
4  134401.60      9737.00  182234.59  326373.19         326373.19  2011

In [17]:
# replace all NA's the value that comes directly after it in the same column, 
# then replace all the reamining na's with 0
subset_df.fillna(method = 'bfill', axis=0).fillna(0)

     BasePay  OvertimePay   OtherPay   TotalPay  TotalPayBenefits  Year
0  167411.18         0.00  400184.25  567595.43         567595.43  2011
1  155966.02    245131.88  137811.38  538909.28         538909.28  2011
2  212739.13    106088.18   16452.60  335279.91         335279.91  2011
3   77916.00     56120.71  198306.90  332343.61         332343.61  2011
4  134401.60      9737.00  182234.59  326373.19         326373.19  2011

In [18]:
df.isnull().values.any()

True

In [19]:
df.isnull().sum()

EmployeeName          0
JobTitle              0
BasePay             606
OvertimePay           1
OtherPay              1
Benefits              0
TotalPay              0
TotalPayBenefits      0
Year                  0
dtype: int64